In [6]:
from datastore import DataStore as ds
import chdb

chdb.query(
    "SELECT * FROM remoteSecure('i0gprfwf1i.us-east-1.aws.clickhouse.cloud', 'default', 'trips', 'default', '.vtXI9G7Jj3E0') LIMIT 5",
    "Dataframe"
)


# ds.from_clickhouse(
#     host="i0gprfwf1i.us-east-1.aws.clickhouse.cloud",
#     # port='9440',
#     database="default",
#     table="trips",
#     user="default",
#     password=".vtXI9G7Jj3E0",
#     secure=True,
# )

# ds.config.enable_debug()


# nat = ds.from_file('../tests/dataset/users.csv')
# nat.sql("select 1").execute()

# nat = nat.filter(nat.age < 35)

# nat['age_minus_10'] = nat['age'] - 10

# nat = nat.add_prefix('col_').filter(nat.col_age > 25).filter(nat.col_country == 'USA')

# nat['doubled'] = nat['col_age'] * 2

# nat2 = nat.sql("doubled > 35")
# nat2 = nat2.filter(nat2.doubled > 25)
# nat2["float_age"] = nat2.doubled.cast("Float64")
# print('Executing...')
# nat2.explain()

# nat2["col_age"]
# # df = nat2.to_df()
# # print(df)

,trip_id,vendor_id,pickup_date,pickup_datetime,dropoff_date,dropoff_datetime,store_and_fwd_flag,rate_code_id,pickup_longitude,pickup_latitude,...,pickup_puma,dropoff_nyct2010_gid,dropoff_ctlabel,dropoff_borocode,dropoff_ct2010,dropoff_boroct2010,dropoff_cdeligibil,dropoff_ntacode,dropoff_ntaname,dropoff_puma
0,1203745557,2,2015-07-01,2015-07-01 00:00:09,2015-07-01,2015-07-01 00:06:27,0,1,-73.975403,40.751900,...,3808,131,101.00,1,Manhattan,1010100,I,MN17,Midtown-Midtown South,3807
1,1201746944,2,2015-07-01,2015-07-01 00:00:12,2015-07-01,2015-07-01 00:08:33,0,1,-73.978737,40.787659,...,3806,115,205.00,1,Manhattan,1020500,I,MN09,Morningside Heights,3802
2,1200864931,2,2015-07-01,2015-07-01 00:00:13,2015-07-01,2015-07-01 00:14:41,0,1,-73.990463,40.746117,...,3807,153,167.00,1,Manhattan,1016700,I,MN12,Upper West Side,3806
3,1201973571,1,2015-07-01,2015-07-01 00:00:51,2015-07-01,2015-07-01 00:32:50,0,1,-73.988441,40.764194,...,3807,130,431.00,2,Bronx,2043100,E,BX43,Norwood,3706
4,1201215784,1,2015-07-01,2015-07-01 00:01:07,2015-07-01,2015-07-01 00:08:07,0,1,-74.013664,40.713779,...,3810,12,15.02,1,Manhattan,1001502,I,MN25,Battery Park City-Lower Manhattan,3810

In [2]:
nat2["col_name"].str.upper()
nat2.to_df()["col_name"].str.upper()
# nat2["col_name"].upper()

NameError: name 'nat2' is not defined

In [ ]:
# Aggregate functions
from datastore.expressions import col
agg_ds = ds.from_file('../tests/dataset/orders.csv')
print(agg_ds.head())

agg_ds.groupby('product_id').agg(
    new_col=col('product_id') * 2, # meaningless column, just for testing
    total_quantity=col('quantity').sum(),
    total_revenue=agg_ds.amount.sum(),
    stddev=col('amount').stddev_samp(),
    stddev2=agg_ds.amount.stddev_samp(),
).to_df()

D Cache invalidated: version now 1
D ======================================================================
D Starting execution (version=1)
D ======================================================================
D Lazy operations chain (1 operations):
D   [1] LIMIT: 5
D Connecting to data source (database=:memory:)...
D Created connection for table function
D [chDB] Connected to database: :memory:
D Connection established successfully
D Discovering schema for table function: DESCRIBE file('../tests/dataset/orders.csv', 'CSVWithNames') SETTINGS session_timezone='UTC'
D ======================================================================
D [chDB] Connection execution
D ----------------------------------------------------------------------
D [chDB] Output format: Dataframe
D [chDB] SQL:
D   DESCRIBE file('../tests/dataset/orders.csv', 'CSVWithNames') SETTINGS session_timezone='UTC'
D ======================================================================
D [chDB] Result: 6 rows x 7 cols
D [chDB] Query time: 1.32ms
D Data source is accessible, schema discovered: {'order_id': 'Nullable(Int64)', 'user_id': 'Nullable(Int64)', 'product_id': 'Nullable(Int64)', 'quantity': 'Nullable(Int64)', 'order_date': 'Nullable(Date)', 'amount': 'Nullable(Float64)'}
D Execution plan: 1 segments (1 SQL, 0 Pandas)
D ExecutionPlan:
  SQL source: True
  Segments: 1
    [1] chDB (from source): 1 ops
D ----------------------------------------------------------------------
D Segment 1/1: chDB (from source): 1 ops
D ----------------------------------------------------------------------
D   Executing SQL: SELECT * FROM file('../tests/dataset/orders.csv', 'CSVWithNames') ORDER BY rowNumberInAllBlocks() LIMIT 5 SETTINGS session_timezone='UTC'
D ======================================================================
D [chDB] Connection execution
D ----------------------------------------------------------------------
D [chDB] Output format: Dataframe
D [chDB] SQL:
D   SELECT * FROM file('../tests/dataset/orders.csv', 'CSVWithNames') ORDER BY rowNumberInAllBlocks() LIMIT 5 SETTINGS session_timezone='UTC'
D ======================================================================
D [chDB] Result: 5 rows x 6 cols
D [chDB] Query time: 2.39ms
D   SQL returned DataFrame with shape: (5, 6)
D ======================================================================
D Execution complete. Final DataFrame shape: (5, 6)
D ======================================================================
D Pure SQL execution: SQL state preserved
D Cache invalidated: version now 1
D to_df() called - triggering execution
D ======================================================================
D Starting execution (version=1)
D ======================================================================
D Lazy operations chain (1 operations):
D   [1] SQL Query: SELECT "product_id", ("product_id"*2) AS "new_col", sum("...
D Connecting to data source (database=:memory:)...
D Created connection for table function
D [chDB] Connected to database: :memory:
D Connection established successfully
D Discovering schema for table function: DESCRIBE file('../tests/dataset/orders.csv', 'CSVWithNames') SETTINGS session_timezone='UTC'
D ======================================================================
D [chDB] Connection execution
D ----------------------------------------------------------------------
D [chDB] Output format: Dataframe
D [chDB] SQL:
D   DESCRIBE file('../tests/dataset/orders.csv', 'CSVWithNames') SETTINGS session_timezone='UTC'
D ======================================================================
D [chDB] Result: 6 rows x 7 cols
D [chDB] Query time: 0.57ms
D Data source is accessible, schema discovered: {'order_id': 'Nullable(Int64)', 'user_id': 'Nullable(Int64)', 'product_id': 'Nullable(Int64)', 'quantity': 'Nullable(Int64)', 'order_date': 'Nullable(Date)', 'amount': 'Nullable(Float64)'}
D Execution plan: 1 segments (0 SQL, 1 Pandas)
D ExecutionPlan:
  SQL source: True
  Segments: 1
    [1] Pandas (from source): 1 ops
D ----------------------------------------------------------------------
D Segment 1/1: Pandas (from source): 1 ops
D ----------------------------------------------------------------------
D   Load SQL for Pandas: SELECT * FROM file('../tests/dataset/orders.csv', 'CSVWithNames') SETTINGS session_timezone='UTC'
D ======================================================================
D [chDB] Connection execution
D ----------------------------------------------------------------------
D [chDB] Output format: Dataframe
D [chDB] SQL:
D   SELECT * FROM file('../tests/dataset/orders.csv', 'CSVWithNames') SETTINGS session_timezone='UTC'
D ======================================================================
D [chDB] Result: 15 rows x 6 cols
D [chDB] Query time: 1.72ms
D   Loaded raw data from source for Pandas: 15 rows
D   [1/1] Executing: SQL Query: SELECT "product_id", ("product_id"*2) AS "new_col", sum("...
D     [chDB] Executing SQL Query: rows=15
D     [chDB] Original input: SELECT "product_id", ("product_id"*2) AS "new_col", sum("quantity") AS "total_quantity", sum("amount") AS "total_revenue", stddevSamp("amount") AS "stddev", stddevSamp("amount") AS "stddev2" FROM __df__ GROUP BY "product_id"
D     [chDB] Expanded query: SELECT "product_id", ("product_id"*2) AS "new_col", sum("quantity") AS "total_quantity", sum("amount") AS "total_revenue", stddevSamp("amount") AS "stddev", stddevSamp("amount") AS "stddev2" FROM __df__ GROUP BY "product_id"
D ======================================================================
D [chDB] DataFrame execution
D ----------------------------------------------------------------------
D [chDB] SQL:
D   SELECT "product_id", ("product_id"*2) AS "new_col", sum("quantity") AS "total_quantity", sum("amount") AS "total_revenue", stddevSamp("amount") AS "stddev", stddevSamp("amount") AS "stddev2" FROM Python(__df__) GROUP BY "product_id"
D ======================================================================
D [chDB] Result: 5 rows x 6 cols
D [chDB] DataFrame query time: 2.17ms (rows_in=15, rows_out=5)
D ======================================================================
D Execution complete. Final DataFrame shape: (5, 6)
D ======================================================================
D Pipeline checkpointed: lazy_ops replaced with DataFrame source

   order_id  user_id  product_id  quantity order_date  amount
0      1001        1         101         2 2024-01-10   59.98
1      1002        2         102         1 2024-01-15  129.99
2      1003        1         103         3 2024-01-20   89.97
3      1004        3         101         1 2024-01-25   29.99
4      1005        4         104         2 2024-02-01  199.98

   product_id  new_col  total_quantity  total_revenue      stddev     stddev2
0         104      208               5         499.95   57.729253   57.729253
1         105      210               4         319.96  113.122943  113.122943
2         101      202               8         239.92   42.412265   42.412265
3         103      206               6         179.94   29.990000   29.990000
4         102      204               4         519.96   75.049761   75.049761

In [ ]:
ds.config.disable_debug()
ch_ds = ds.from_clickhouse("sql-clickhouse.clickhouse.com", "pypi", "pypi_downloads", "demo", "", secure=True)

print(ch_ds.head(10))

                 project  count
0                      0      1
1  2captcha-python-async      1
2                   2to3      1
3                  3dfin      1
4     a-pandas-ex-xml2df      1
5                a2a-sdk      7
6                   a2ml      1
7                   a2p2      1
8                 a2wsgi     36
9                    a7p      1